In [1]:
import pandas as pd
import numpy as np

### Converting Dictionary Data into Table :-

In [3]:
dict1 = {
    "name" : ["Karan", "Rohan", "Rohit"],
    "marks" : [85, 90, 95],
    "city" : ["Haldwani", "Rampur", "Rudarpur"]
}

df = pd.DataFrame(dict1)
print("Original DataFrame : \n" , df)

Original DataFrame :
     name  marks      city
0  Karan     85  Haldwani
1  Rohan     90    Rampur
2  Rohit     95  Rudarpur

### Converting Data into Excel sheet :-

In [5]:
df.to_csv('friends.csv' , index=False)

In [6]:
df.head(2)

    name  marks      city
0  Karan     85  Haldwani
1  Rohan     90    Rampur

In [7]:
df.tail(2)

    name  marks      city
1  Rohan     90    Rampur
2  Rohit     95  Rudarpur

In [8]:
df.describe()

       marks
count    3.0
mean    90.0
std      5.0
min     85.0
25%     87.5
50%     90.0
75%     92.5
max     95.0

### Read CSV file :- (EXCEL)

In [9]:
read_csv = pd.read_csv('friends.csv')
print("DataFrame from CSV file : \n", read_csv)

DataFrame from CSV file :
     name  marks      city
0  Karan     85  Haldwani
1  Rohan     90    Rampur
2  Rohit     95  Rudarpur

### Updating values in CSV :-

In [11]:
read_csv['marks'][0] = 99

C:\Users\karan\AppData\Local\Temp\ipykernel_17100\2634288808.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  read_csv['marks'][0] = 99
C:\Users\karan\AppData\Local\Temp\ipykernel_17100\2634288808.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  read_csv['marks'][0] = 99

In [14]:
read_csv

    name  marks      city
0  Karan     99  Haldwani
1  Rohan     90    Rampur
2  Rohit     95  Rudarpur

In [15]:
## writing back updated marks in csv file 
read_csv.to_csv('friends.csv', index=False)

### Changing index from number to words :-

In [ ]:
read_csv.index = ['First' , 'Second' , 'Third'] 
read_csv

         name  marks      city
First   Karan     99  Haldwani
Second  Rohan     90    Rampur
Third   Rohit     95  Rudarpur